reports/mysql-coupon-loadtest/runs/redis-compare-redlock-500rps-pool20-001/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/coupon-arrival-rate.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 40s max duration (incl. graceful stop):
              * unique_member_first_request: 500.00 iterations/s for 10s (maxVUs: 200-2000, gracefulStop: 30s)


running (01.0s), 0317/0317 VUs, 26 complete and 0 interrupted iterations
unique_member_first_request   [  10% ] 0317/0317 VUs  01.0s/10s  500.00 iters/s

running (02.0s), 0510/0511 VUs, 134 complete and 0 interrupted iterations
unique_member_first_request   [  20% ] 0510/0511 VUs  02.0s/10s  500.00 iters/s

running (03.0s), 0696/0697 VUs, 258 complete and 0 interrupted iterations
unique_member_first_request   [  30% ] 0696/0697 VUs  03.0s/10s  500.00 iters/s

running (04.0s), 0878/0879 VUs, 387 complete and 0 interrupted iterations
unique_member_first_request   [  40% ] 0878/0879 VUs  04.0s/10s  500.00 iters/s

running (05.0s), 1055/1055 VUs, 528 complete and 0 interrupted iterations
unique_member_first_request   [  50% ] 1055/1055 VUs  05.0s/10s  500.00 iters/s

running (06.0s), 1212/1212 VUs, 700 complete and 0 interrupted iterations
unique_member_first_request   [  60% ] 1212/1212 VUs  06.0s/10s  500.00 iters/s

running (07.0s), 1380/1381 VUs, 863 complete and 0 interrupted iterations
unique_member_first_request   [  70% ] 1380/1381 VUs  07.0s/10s  500.00 iters/s

running (08.0s), 1552/1552 VUs, 1017 complete and 0 interrupted iterations
unique_member_first_request   [  80% ] 1552/1552 VUs  08.0s/10s  500.00 iters/s

running (09.0s), 1705/1706 VUs, 1208 complete and 0 interrupted iterations
unique_member_first_request   [  90% ] 1705/1706 VUs  09.0s/10s  500.00 iters/s

running (10.0s), 1881/1881 VUs, 1256 complete and 0 interrupted iterations
unique_member_first_request   [ 100% ] 1881/1881 VUs  10.0s/10s  500.00 iters/s

running (11.0s), 1678/1889 VUs, 1470 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1888/1888 VUs  10s  500.00 iters/s

running (12.0s), 1448/1889 VUs, 1700 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1888/1888 VUs  10s  500.00 iters/s

running (13.0s), 1238/1889 VUs, 1910 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1888/1888 VUs  10s  500.00 iters/s

running (14.0s), 1020/1889 VUs, 2128 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1888/1888 VUs  10s  500.00 iters/s

running (15.0s), 0797/1889 VUs, 2351 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1888/1888 VUs  10s  500.00 iters/s

running (16.0s), 0582/1889 VUs, 2566 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1888/1888 VUs  10s  500.00 iters/s

running (17.0s), 0358/1889 VUs, 2790 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1888/1888 VUs  10s  500.00 iters/s

running (18.0s), 0135/1889 VUs, 3013 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 1888/1888 VUs  10s  500.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 3148   169.154222/s
    checks_succeeded...: 92.50% 2912 out of 3148
    checks_failed......: 7.49%  236 out of 3148

    ✗ business response or no server error
      ↳  92% — ✓ 2912 / ✗ 236

    CUSTOM
    coupon_issue_business_response_under_2s...: 8.92%  281 out of 3148
    coupon_issue_issued.......................: 1000   53.73387/s
    coupon_issue_rejected.....................: 2094   112.518724/s

    HTTP
    http_req_duration.........................: avg=5.86s min=11ms    med=6.39s max=10s   p(90)=8.61s p(95)=9.35s
      { expected_response:true }..............: avg=2.97s min=11ms    med=3.04s max=5.93s p(90)=4.52s p(95)=4.78s
    http_req_failed...........................: 68.23% 2148 out of 3148
    http_reqs.................................: 3148   169.154222/s

    EXECUTION
    dropped_iterations........................: 1853   99.568861/s
    iteration_duration........................: avg=5.86s min=12.14ms med=6.39s max=10s   p(90)=8.61s p(95)=9.35s
    iterations................................: 3148   169.154222/s
    vus.......................................: 135    min=135          max=1880
    vus_max...................................: 1889   min=317          max=1889

    NETWORK
    data_received.............................: 625 kB 34 kB/s
    data_sent.................................: 1.0 MB 55 kB/s



running (18.6s), 0000/1889 VUs, 3148 complete and 0 interrupted iterations
unique_member_first_request ✓ [ 100% ] 0000/1889 VUs  10s  500.00 iters/s